{
  "activation": "gelu",
  "architectures": [
    "DistilBertForMaskedLM"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "hidden_dim": 3072,
  "id2label": {
    "0": "O",
    "1": "B-PER",
    "2": "I-PER",
    "3": "B-LOC",
    "4": "I-LOC",
    "5": "B-ORG",
    "6": "I-ORG"
  },
  "initializer_range": 0.02,
  "label2id": {
    "B-LOC": 3,
    "B-ORG": 5,
    "B-PER": 1,
    "I-LOC": 4,
    "I-ORG": 6,
    "I-PER": 2,
    "O": 0
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "output_hidden_states": true,
  "pad_token_id": 0,
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": true,
  "tie_weights_": true,
  "transformers_version": "4.47.0",
  "vocab_size": 32000
}
